Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/the_irish_education_system/home_education.html.txt.tmx
Source language: en
Languages: ga

source: Teaching your child at home
ga: Do leanbh a mhúineadh sa bhaile

source: Parents have a constitutional right to educate their children at home
ga: Tá ceart bunreachtúil ag tuismitheoirí oideachas a chur ar a gcuid leanaí sa bhaile

source: If you choose to home-school your child, you do not need a formal teaching qualification or curriculum but you must ensure that your child receives a certain minimum education
ga: Má roghnaíonn tú chun scolaíocht bhaile a thabhairt do do leanbh, ní theastaíonn cáilíocht nó curaclam foirmiúil teagaisc uait ach ní mór duit a chinntiú go bhfaigheann do leanbh oideachas íosta ar leith

source: You can adopt the approach you feel best suits the learning needs of your child to make sure that he or she is learning successfully and making reasonable progress, given his or her age, ability, aptitude and learning needs
ga: Féadfaidh tú glacadh le pé cur chuige is mian leat a bhraitheann tú is mó a oireann do riachtanais foghlama do linbh, lena chinntiú go bhfuil foghlaim cheart agus dul chun cinn réasúnta á dhéanamh aige/aici, agus aird ar a (h)aois, c(h)umas, m(h)ianach agus riachtanais foghlama

source: The Irish constitution recognises the family as the primary educator of the child and defines duties and responsibilities for parents and the State in the education of children
ga: Aithníonn Bunreacht na hÉireann an teaghlach mar phríomhoideoir an linbh agus sainmhíníonn sé dualgais agus freagrachtaí tuismitheoirí agus an Stáit maidir le hoideachas a chur ar leanaí

source: Section 14 of the Education (Welfare) Act 2000 makes provision for parents to educate their children in places other than recognised schools, such as in the home or in private schools where they are not required to follow a national curriculum. The Act states that parents must ensure their child receives a certain minimum education
ga: Déanann Alt 14 den Acht um Oideachas (Leas), 2000 an fhoráil gur féidir le tuismitheoirí oideachas a chur ar a leanaí in áiteanna eile seachas scoileanna aitheanta, ar nós sa bhaile nó i scoileanna príobháideacha, sa chás nach gceanglaítear orthu curaclam náisiúnta a leanúint

source: Guidelines on the Assessment of Education in places other than recognised schools (pdf) have been published under section 16 of the Act
ga: Faoi alt 16 an Achta d'fhoilsigh an tAire Oideachais agus Eolaíochta Treoirlínte maidir le Oideachas in áiteanna seachas scoileanna aitheanta (pdf)

source: The guidelines provide a working definition of “a certain minimum education”, describe home-based education and offer guidance on how it may be assessed
ga: Sonraíonn na treoirlínte sainmhíniú oibre ar 'oideachas íosta áirithe', déanann siad cur síos ar oideachas atá bunaithe sa bhaile agus tugtar treoir maidir leis an gcaoi is féidir measúnú a dhéanamh air

source: They also cover the legal background of home education
ga: Clúdaíonn siad freisin an cúlra dlí a bhaineann le hoideachas sa bhaile

source: The State has a duty to ensure that children receive a certain minimum education, but parents are free to determine how this education is provided
ga: Tá sé de dhualgas ar an Stát a chinntiú go bhfaigheann leanaí oideachas íosta áirithe, ach tá saoirse ag tuismitheoirí cinneadh a dhéanamh maidir leis an gcaoi a chuirtear an t-oideachas seo ar fáil

source: The law does not define a “certain minimum education”
ga: Ní shainmhíníonn an dlí "oideachas íosta áirithe"

source: The guidelines provide a definition of the broad characteristics, which require that a child’s education should:
ga: Cuireann na treoirlínte sainmhíniú ar fáil ar na tréithe ginearálta, a shonraíonn go gcaithfidh oideachas an linbh:

source: • Be suited to the age, ability, aptitude and personality of the child
ga: • A bheith oiriúnach d'aois, do chumas, d'inniúlacht agus do phearsantacht an linbh

source: • Be responsive to the child’s individual needs, should take cognisance of the areas of learning that are of interest to the child, and should ensure that his/her personal potential is enhanced and not suppressed
ga: • A bheith freagrúil do riachtanais aonair an linbh, ba chóir dó aird a thabhairt ar na réimsí foghlama atá spéisiúil don leanbh, agus ba chóir dó cinntiú go bhfuil a (h)acmhainneacht phearsanta feabhsaithe seachas sochta

source: • Address the immediate and prospective needs of the child, in the context of the cultural, economic and social environment
ga: • Freastal a dhéanamh ar riachtanais phráinneacha agus ionchais an linbh, i gcomhthéacs an chomhshaoil chultúrtha, eacnamaíoch agus shóisialta

source: • Provide a reasonably balanced range of learning experiences, so that no one aspect of the child’s learning is emphasised to the exclusion of others
ga: • Raon eispéireas foghlama atá cuíosach cothromaithe, ionas nach gcuirtear béim ar aon ghné amháin d'fhoghlaim an linbh agus eisiamh ar ghnéithe eile

source: • Develop the personal and social skills of the child and prepare him/her for the responsibilities of citizenship
ga: • Forbairt a dhéanamh ar scileanna pearsanta agus sóisialta an linbh agus é/í a ullmhú le haghaidh dualgas na saoránachta

source: • Contribute to the moral development of the child
ga: • Cur le forbairt mhórálta an linbh

source: • Provide opportunities for the child to develop his/her intellectual capacities and understanding
ga: • Deiseanna a chur ar fáil don leanbh chun a c(h)umais intleachtúla agus a t(h)uiscint a fhorbairt

source: The guidelines also require that basic skills, without which a child would be placed at a serious disadvantage, should be taken into account in a definition of this minimum education
ga: Sonraíonn na treoirlínte chomh maith go gcaithfidh na scileanna bunúsacha a mbeadh leanbh faoi mhíbhuntáiste tromchúiseach gan iad, tugtha san áireamh faoi shainmhíniú an oideachais íosta seo

source: Development and progression in oral language, literacy and numeracy are vital for other areas of learning and for the child to participate in society and everyday life
ga: Tá forbairt agus dul chun cinn ar chumas labhartha, litearthachta agus uimhearthachta ríthábhachtach le haghaidh réimsí eile foghlama agus le haghaidh rannpháirteachas an linbh sa tsochaí agus sa tsaol laethúil

source: Role of the Child and Family Agency
ga: Ról an nGníomhaireacht um Leanaí agus an Teaghlach

source: The Child and Family Agency is obliged to maintain a register of children who are receiving education but not attending a recognised school
ga: Tá iachall ar an nGníomhaireacht um Leanaí agus an Teaghlach clár a chothabháil de leanaí atá ag fáil oideachais ach nach bhfuil ag freastal ar scoil aitheanta

source: In effect, this register will show the names of children who are being educated at home or in private non-recognised schools
ga: Go héifeachtach, léireoidh an clár seo ainmneacha leanaí a bhfuil oideachas á chur orthu sa bhaile nó i scoileanna príobháideacha neamhaitheanta

source: All parents or guardians who want to educate their children at home must register their child with the Child and Family Agency
ga: Ní mór do thuismitheoirí nó do chaomhnóirí uile a dteastaíonn uathu oideachas a chur ar a gcuid leanaí sa bhaile in Éirinn a leanbh a chlárú leis an nGníomhaireacht um Leanaí agus an Teaghlach

source: Parents of children who attend private non recognised schools should make an application through the school
ga: Ba cheart do thuismitheoirí leanaí a fhreastalaíonn ar scoileanna príobháideacha neamhaitheanta iarratas a dhéanamh tríd an scoil

source: It is a legal obligation and the onus is on parents or guardians to make an application on behalf of their child
ga: Is oibleagáid dhlíthiúil í agus tá dualgas ar thuismitheoirí nó ar chaomhnóirí iarratas a dhéanamh thar ceann an linbh

source: On 1 January 2014, the National Educational Welfare Board was abolished and its functions transferred to the Child and Family Agency
ga: Cuireadh deireadh leis an mBord Náisiúnta Leasa Oideachais an 1 Eanáir 2014 agus d’aistríodh a fheidhmeanna chuig an nGníomhaireacht um Leanaí agus an Teaghlach

source: You can apply directly to the Child and Family Agency – see ‘Where to apply’ below
ga: Féadfaidh tú iarratas a dhéanamh go díreach ar an nGníomhaireacht um Leanaí agus an Teaghlach – féach ‘Cá ndéanfaidh mé iarratas?

source: The Child and Family Agency will send you an application form and a copy of the guidelines Guidelines on the assessment of education in places other than recognised schools (pdf)
ga: Seolfaidh an nGníomhaireacht um Leanaí agus an Teaghlach foirm iarratais chugat mar aon le Treoirlínte ar mheasúnú an oideachais in áiteanna eile seachas i scoileanna aitheanta (pdf)

source: Assessment: when you return the application form you will be contacted by the person who will carry out the assessment to arrange a convenient time and date
ga: Measúnú: nuair a sheolann tú an fhoirm iarratais ar ais, déanfaidh an duine a thabharfaidh faoin measúnú teagmháil leat chun am agus dáta a shocrú a oireann duit

source: This person is authorised by the Child and Family Agency and is experienced in education
ga: Tá an duine seo údaraithe ag an nGníomhaireacht um Leanaí agus an Teaghlach agus tá taithí acu leis an oideachas

source: The assessment will focus on the details of the education that is being provided to the child, the materials used in the course of the education and the time spent providing that education
ga: Díreoidh an measúnú ar shonraí an oideachais atá á chur ar fáil don leanbh, na hábhair atá á n-úsáid i gcúrsa an oideachais agus an méid ama atá á chaitheamh chun an t-oideachas sin a chur ar fáil

source: The interview can take place in a venue of your choice and will be based on what you have said in your application
ga: Féadfaidh an t-agallamh titim amach i do rogha ionaid agus bunófar é ar a raibh ráite agat i d’iarratas

source: This is called the preliminary assessment
ga: Tugtar an réamh-mheasúnú air seo

source: Your assessor will complete a draft assessment report and a copy of this is forwarded to you for comment
ga: Comhlánóidh do mheasúnóir dréacht-tuairisc mheasúnaithe agus seolfar cóip den tuairisc seo ar aghaidh chugat le do thuairimí a fháil ina taobh

source: Following the report your child’s name will either be entered into the register or your case will be referred for a comprehensive assessment
ga: I ndiaidh na tuarascála cuirfear ainm do linbh ar chlár nó cuirfear do chás ar aghaidh chun measúnú cuimsitheach a dhéanamh air

source: If the Child and Family Agency is not able to determine whether you are providing a minimum education, a comprehensive assessment will be carried out
ga: Mura féidir leis an nGníomhaireacht um Leanaí agus an Teaghlach cinneadh a dhéanamh cé acu an bhfuil oideachas íosta á chur ar fáil agat, déanfar measúnú cuimsitheach

source: This is more in-depth and involves the assessor spending some time with you, observing how you teach or work with your child, inspecting your educational materials and talking to your child
ga: Tá sé seo i bhfad níos doimhne agus is éard atá i gceist leis ná go gcaithfidh an measúnóir níos mó ama leat, ag féachaint ar an gcaoi a mhúineann tú do leanbh, na hábhair oideachais atá agat a iniúchadh agus labhairt le do leanbh

source: If the Child and Family Agency decides that you are not providing a certain minimum education for your child, it can refuse to register or remove your child’s name from the register
ga: Má shocraíonn an nGníomhaireacht um Leanaí agus an Teaghlach nach bhfuil tú ag soláthar oideachais íosta áirithe do do leanbh, is féidir leis ainm an linbh a bhaint ón gclár nó diúltú é a chur leis an gclár ar an gcéad dul síos

source: It must inform you of its decision in writing and you have 21 days to appeal against the decision
ga: Ní mór dó a chinneadh a chur in iúl duit i scríbhinn agus ansin tá 21 lá agat achomharc a dhéanamh i gcoinne an chinnidh

source: The Minister will appoint a committee to hear the appeal and make a decision on the case
ga: Beidh ar an Aire coiste a cheapadh chun an t-achomharc a éisteacht agus cinneadh a dhéanamh faoin gcás

source: An appeal committee is made up of a District Court judge, an inspector and such other person as may be appointed thereto by the Minister
ga: Tá coiste achomhairc comhdhéanta de bhreitheamh ón gCúirt Dúiche, de chigire agus de dhuine ar bith eile a d'fhéadfadh an tAire a cheapadh

source: You and the assessor are invited to make submissions on the case
ga: Tugtar cuireadh duit agus do do mheasúnóir aighneachtaí a dhéanamh maidir leis an gcás

source: Depending on their decision, the committee will:
ga: Ag brath ar a gcinneadh, déanfaidh an coiste:

source: • Affirm the decision of the Child and Family Agency to remove or refuse to add your child’s name to the register
ga: • Cinneadh an nGníomhaireacht um Leanaí agus an Teaghlach a dheimhniú chun ainm do linbh a bhaint ón gclár nó diúltú é a chur leis an gclár

source: • Require the Child and Family Agency to add your child’s name to the register
ga: • Iachall a chur ar an nGníomhaireacht um Leanaí agus an Teaghlach ainm do linbh a chur leis an gclár

source: • Require the Child and Family Agency to add your child’s name to the register, subject to your undertaking to comply with any requirements the appeal committee considers appropriate
ga: • Iachall a chur ar an nGníomhaireacht um Leanaí agus an Teaghlach ainm do linbh a chur leis an gclár, faoi réir ag do ghealltanas cloí le riachtanais ar bith a mheasann an coiste achomhairc a bheith iomchuí

source: When it comes time to sit formal exams, arrangements can be made through Education and Training Boards (ETBs) or adult education classes
ga: Nuair a thagann an t-am chun scrúduithe foirmiúla a dhéanamh, is féidir socruithe a dhéanamh trí na cBoird Oideachais agus Oiliúna (BOO) nó ranganna oideachais aosaigh

source: Junior and Leaving Certificate examinations can also be sat at any school by registering with the school in early January of the year that the exams will be taken
ga: Is féidir scrúduithe Sóisearacha agus Ardteistiméireachta a dhéanamh ag scoil ar bith trí chlárú a dhéanamh leis an scoil go luath i mí Eanáir na bliana a dhéanfar na scrúduithe

source: Further information is available from the State Examinations Commission
ga: Tá tuilleadh eolais ar fáil ó Choimisiún na Scrúduithe Stáit

source: If a child does not sit State examinations then entry to third-level education in Ireland is difficult
ga: Mura ndéanann leanbh na scrúduithe Stáit bíonn deacracht ann maidir le freastal ar oideachas tríú leibhéil in Éirinn

source: The normal route into Irish third-level institutions is through the Leaving Certificate
ga: Is í an Ardteistiméireacht an gnáthbhealach chuig institiúidí tríú leibhéil na hÉireann

source: However, it may also be possible to enter third-level education at aged 17 or 18 without the Leaving Certificate by interview only
ga: É sin ráite, d'fhéadfadh sé a bheith indéanta freastal ar oideachas tríú leibhéil ag aois 17 nó 18 gan an Ardteistiméireacht ach agallamh a dhéanamh

source: You would need to approach your chosen institution to discuss this possibility
ga: Bheadh ort dul i dteagmháil le d'institiúid roghnaithe chun an fhéidearthacht seo a phlé

source: There are a variety of courses for the 16-plus age group which are accepted as valid for entry to third-level courses
ga: Tá réimse cúrsaí ann don aoisghrúpa 16 bliana agus níos sine agus glactar leo mar chúrsaí bailí chun áit a fháil ar chúrsa tríú leibhéal

source: You can find out more about further and higher education and training courses from Qualifax - The National Learner's Database
ga: Féadfaidh tú teacht ar thuilleadh faisnéise faoi chúrsaí breisoideachais agus ardoideachais ó Qualifax – an Bunachar Sonraí Náisiúnta d’Fhoghlaimeoirí

source: Mature students are not subject to the usual entry requirements
ga: Níl mic léinn lánfhásta faoi réir ag na gnáth-riachtanais iontrála

source: There are also a growing number of correspondence courses on offer, such as the Open University
ga: Tá líon méadaitheach cúrsaí comhfhreagartha ar tairiscint, mar an Ollscoil Oscailte

source: Aontas - the National Association of Adult Education is a source of information on distance learning in Ireland
ga: Is foinse faisnéise é Aontas - an Cumann Náisiúnta um Oideachas Aosach ar chianfhoghlaim in Éirinn

source: If you choose to teach your child at home, the Home Education Network is a support and lobby group for home educators in Ireland
ga: Má dhéanann tú rogha do leanbh a mhúineadh sa bhaile, is tacaíocht agus brúghrúpa é an Líonra um Oideachas sa Bhaile d'oideoirí sa bhaile in Éirinn

source: It aims to help parents use the available resources to develop educational techniques suitable for each child’s needs
ga: Cuireann siad rompu cabhrú le tuismitheoirí na hacmhainní atá ar fáil a úsáid agus modhanna oideachais a fhorbairt a fheilfidh do riachtanais gach linbh

source: It also provides a means for the exchange of ideas and experience among home educators through regular meetings and newsletters
ga: Cabhraíonn sé le lucht oideachais sa bhaile a gcuid tuairimí agus an taithí atá acu a mhalartú lena chéile trí chruinnithe rialta a bheith acu agus trí nuachtlitreacha

source: Its website contains links to research and online information about home education and it also operates a library service of books on home education that is available to members. Rates
ga: Tá naisc le taighde agus le faisnéis ar líne faoi oideachas sa bhaile le fáil ar a láithreán gréasáin agus is féidir leis na baill leabhair faoin ábhar seo a fháil ó sheirbhís leabharlainne an ghrúpa
